#отрисовка

import os
import numpy

class ConsoleIO(object):

    t_empty = "   \n   \n   "
    t_cross = "* *\n * \n* *"
    t_zero = " * \n* *\n * "



    t_matrix = ""

    def __init__(self):
        
        self.t_matrix = ""

        pass

    def demo(self):
        # 
        print( 
            b'\xd0\x91\xd0\xb0\xd0\xb9\xd1\x82\xd1\x8b'.decode('utf-8')
        )

        # подставить временную переменную

        tt_cell = numpy.array([ 
                        '   ', 
                        '   ', 
                        '   ',
                      ])

        print('╔' + '═' * 3 + '╦'+ '═' * 3 + '╦'+ '═' * 3 + '╗') 

        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 
        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 
        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 

        print('╠' + '═' * 3 + '╬'+ '═' * 3 + '╬'+ '═' * 3 + '╣')
        
        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 
        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 
        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 

        print('╠' + '═' * 3 + '╬'+ '═' * 3 + '╬'+ '═' * 3 + '╣')

        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 
        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 
        print('║' + ' ' * 3 + '║'+ ' ' * 3 + '║'+ ' ' * 3 + '║') 

        print('╚' + '═' * 3 + '╩'+ '═' * 3 + '╩'+ '═' * 3 + '╝')



        pass

    pass




